[
  {
    "id": 1,
    "name": "Jasminelle",
    "types": ["floral"],
    "description": "Tímida e graciosa, costuma habitar jardins silenciosos longe da agitação. Jasminelle prefere observar sem ser notada, mas quando ameaçada, exala um aroma que altera a percepção dos oponentes. Ela desabrocha seu verdadeiro potencial em sua capacidade de cura.",
    "flavorProfile": "Jasmim",
    "weight": 12.5,
    "height": 0.8,
    "baseHp": 95,
    "baseAttack": 50,
    "baseDefense": 55,
    "baseSpeed": 60
  },
  {
    "id": 2,
    "name": "Limonetto",
    "types": ["fruity", "sour"],
    "description": "Uma bola de pura energia cítrica encontrada em pomares ensolarados. Limonetto é extremamente agitado e não consegue ficar parado, correndo em círculos para gastar sua eletricidade estática. Sua vibração constante é um aviso de que uma descarga de energia pode ocorrer a qualquer momento.",
    "flavorProfile": "Limão",
    "weight": 8.0,
    "height": 0.6,
    "baseHp": 80,
    "baseAttack": 65,
    "baseDefense": 35,
    "baseSpeed": 85
  },
  {
    "id": 3,
    "name": "Maprion",
    "types": ["sweet"],
    "description": "Dócil e gentil, habita florestas temperadas e vive em ritmo desacelerado. Maprion adora abraços, embora deixe tudo grudento com seu xarope natural. Apesar de sua aparência inofensiva, sua viscosidade pode prender fatalmente qualquer um que tente perturbar seu descanso.",
    "flavorProfile": "Maple",
    "weight": 120.0,
    "height": 1.5,
    "baseHp": 110,
    "baseAttack": 50,
    "baseDefense": 50,
    "baseSpeed": 50
  },
  {
    "id": 4,
    "name": "Emberly",
    "types": ["roasted"],
    "description": "Sempre empolgada, Emberly habita regiões próximas a fontes de calor natural. Ela estala como lenha na fogueira quando se movimenta, iluminando o ambiente. Seu entusiasmo caloroso é contagiante, mas faíscas ocasionais revelam um poder explosivo se ela for provocada.",
    "flavorProfile": "Brasa",
    "weight": 25.0,
    "height": 0.9,
    "baseHp": 90,
    "baseAttack": 70,
    "baseDefense": 45,
    "baseSpeed": 70
  },
  {
    "id": 5,
    "name": "Almondino",
    "types": ["nutty"],
    "description": "Sólido como uma rocha, vive em terrenos montanhosos testando sua resistência. Almondino passa horas imóvel fortalecendo sua casca. Ele age como um guardião silencioso, e dizem que sua defesa é tão densa que nem os impactos mais fortes conseguem fazê-lo recuar.",
    "flavorProfile": "Amêndoa",
    "weight": 45.0,
    "height": 1.1,
    "baseHp": 95,
    "baseAttack": 55,
    "baseDefense": 75,
    "baseSpeed": 45
  },
  {
    "id": 6,
    "name": "Gingerlynn",
    "types": ["spicy"],
    "description": "Encontrada em tocas aquecidas, Gingerlynn tem um espírito acolhedor que conforta a todos, como um abraço em dia frio. Ela usa seu calor para proteger seu território, mas esse mesmo calor pode se tornar sufocante e picante para quem ameaçar sua paz.",
    "flavorProfile": "Gengibre",
    "weight": 15.0,
    "height": 0.7,
    "baseHp": 85,
    "baseAttack": 75,
    "baseDefense": 50,
    "baseSpeed": 80
  },
  {
    "id": 7,
    "name": "Jack",
    "types": ["fermented", "roasted"],
    "description": "Com a aura de um mafioso clássico, Jack prefere a escuridão de porões e adegas da cidade. Ele é um cavalheiro de poucas palavras, resolvendo conflitos com uma calma fria e implacável. Seu olhar penetrante sugere que ele sempre tem um truque elegante ou um golpe pesado guardado na manga.",
    "flavorProfile": "Whiskey",
    "weight": 60.0,
    "height": 1.4,
    "baseHp": 105,
    "baseAttack": 85,
    "baseDefense": 65,
    "baseSpeed": 50
  },
  {
    "id": 8,
    "name": "Chamomilley",
    "types": ["floral"],
    "description": "Vive com sono, flutuando em sua própria brisa relaxante sobre campos abertos. Chamomilley dificilmente acorda completamente, até em batalhas, mas seu bocejo é contagiosamente perigoso, capaz de colocar até os oponentes mais ferozes em um transe profundo.",
    "flavorProfile": "Camomila",
    "weight": 6.0,
    "height": 0.5,
    "baseHp": 95,
    "baseAttack": 45,
    "baseDefense": 85,
    "baseSpeed": 60
  },
  {
    "id": 9,
    "name": "Crambeline",
    "types": ["fruity", "sour"],
    "description": "Elegante e misteriosa, aparece nos vinhedos durante o crepúsculo. Crambeline possui um charme hipnótico e um sorriso enigmático que esconde sua natureza predatória. Ela não precisa de força bruta; prefere drenar lentamente a vitalidade de quem cai em seus encantos.",
    "flavorProfile": "Cranberry",
    "weight": 30.0,
    "height": 1.2,
    "baseHp": 70,
    "baseAttack": 85,
    "baseDefense": 40,
    "baseSpeed": 100
  }
]